{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_1",
            "layers": [
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 10,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": "glorot_uniform",
                        "bias_initializer": "zeros",
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_1",
                        "trainable": true,
                        "batch_input_shape": [null, 3],
                        "dtype": "float32"
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 1,
                        "activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": "glorot_uniform",
                        "bias_initializer": "zeros",
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_2",
                        "trainable": true
                    }
                }
            ]
        },
        "keras_version": "2.4.0",
        "backend": "tensorflow"
    },
    "weightsManifest": [
        {
            "paths": ["weights.bin"],
            "weights": [
                {"name": "dense_1/kernel", "shape": [3, 10], "dtype": "float32"},
                {"name": "dense_1/bias", "shape": [10], "dtype": "float32"},
                {"name": "dense_2/kernel", "shape": [10, 1], "dtype": "float32"},
                {"name": "dense_2/bias", "shape": [1], "dtype": "float32"}
            ]
        }
    ]
}